[Timeout] BlockStatement
src/services/CheckoutService.js:2:83
 class CheckoutService {
-  constructor(gatewayPagamento, pedidoRepository, emailService, logger = console) {
-    this.gatewayPagamento = gatewayPagamento;
-    this.pedidoRepository = pedidoRepository;
-    this.emailService = emailService;
-    this.logger = logger;
-  }
+  constructor(gatewayPagamento, pedidoRepository, emailService, logger = console) {}
 
   async processar(pedido) {

[Killed] ConditionalExpression
src/services/CheckoutService.js:12:11
   async processar(pedido) {
     try {
       const resposta = await this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
-      if (resposta.status === 'APROVADO') {
+      if (false) {
         return await this._handleAprovado(pedido);
       } else {
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/services/CheckoutService.js:22:33
     }
   }
 
-  async _handleAprovado(pedido) {
-    pedido.status = 'PROCESSADO';
-    const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
-    this.emailService
-      .enviarConfirmacao(pedido.clienteEmail, 'Pagamento Aprovado')
-      .catch(err => this.logger.error('Falha ao enviar e-mail:', err.message));
-    return pedidoSalvo;
-  }
+  async _handleAprovado(pedido) {}
 
   async _handleRecusado(pedido) {
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] StringLiteral
src/services/CheckoutService.js:23:21
   }
 
   async _handleAprovado(pedido) {
-    pedido.status = 'PROCESSADO';
+    pedido.status = "";
     const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
     this.emailService
killedBy: CheckoutService — tratamento de falha no e-mail (mata M5) deve logar erro quando o envio de e-mail falha, sem derrubar o fluxo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: ""

[Killed] ArrowFunction
src/services/CheckoutService.js:27:14
     const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
     this.emailService
       .enviarConfirmacao(pedido.clienteEmail, 'Pagamento Aprovado')
-      .catch(err => this.logger.error('Falha ao enviar e-mail:', err.message));
+      .catch(() => undefined);
     return pedidoSalvo;
   }
killedBy: CheckoutService — tratamento de falha no e-mail (mata M5) deve logar erro quando o envio de e-mail falha, sem derrubar o fluxo
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao enviar e-mail:", "SMTP indisponível"

Number of calls: 0

[Killed] StringLiteral
src/services/CheckoutService.js:27:39
     const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
     this.emailService
       .enviarConfirmacao(pedido.clienteEmail, 'Pagamento Aprovado')
-      .catch(err => this.logger.error('Falha ao enviar e-mail:', err.message));
+      .catch(err => this.logger.error("", err.message));
     return pedidoSalvo;
   }
killedBy: CheckoutService — tratamento de falha no e-mail (mata M5) deve logar erro quando o envio de e-mail falha, sem derrubar o fluxo
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao enviar e-mail:", "SMTP indisponível"
Received: "", "SMTP indisponível"

Number of calls: 1

[Killed] StringLiteral
src/services/CheckoutService.js:32:21
   }
 
   async _handleRecusado(pedido) {
-    pedido.status = 'FALHOU';
+    pedido.status = "";
     await this.pedidoRepository.salvar(pedido);
     return null;
killedBy: CheckoutService Caminho N5 — pagamento RECUSADO (falha de negócio) deve salvar o pedido com status FALHOU
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "FALHOU"}
Received: {"cartao": {"cvv": "123", "numero": "4111111111111111", "validade": "12/2028"}, "clienteEmail": "cliente@email.com", "status": "", "valor": 150}

Number of calls: 1

[Killed] BlockStatement
src/services/CheckoutService.js:37:43
     return null;
   }
 
-  async _handleErroGateway(pedido, error) {
-    this.logger.error('Falha catastrófica no gateway bancário:', error.message);
-    pedido.status = 'ERRO_GATEWAY';
-    await this.pedidoRepository.salvar(pedido);
-    return null;
-  }
+  async _handleErroGateway(pedido, error) {}
 }
 
killedBy: CheckoutService Caminho N6 — ERRO_GATEWAY (falha de infraestrutura / catch) deve retornar null quando o gateway lança exceção
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] StringLiteral
src/services/CheckoutService.js:39:21
 
   async _handleErroGateway(pedido, error) {
     this.logger.error('Falha catastrófica no gateway bancário:', error.message);
-    pedido.status = 'ERRO_GATEWAY';
+    pedido.status = "";
     await this.pedidoRepository.salvar(pedido);
     return null;
killedBy: CheckoutService Caminho N6 — ERRO_GATEWAY (falha de infraestrutura / catch) deve salvar o pedido com status ERRO_GATEWAY
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "ERRO_GATEWAY"}
Received: {"cartao": {"cvv": "123", "numero": "4111111111111111", "validade": "12/2028"}, "clienteEmail": "cliente@email.com", "status": "", "valor": 150}

Number of calls: 1
